# GetWallInsLocByStyle

## Description
Gets whether the wall insert location of a symbol definition, plug-in object style, or plug-in object is by style.

```pascal
FUNCTION GetWallInsLocByStyle(hObject : HANDLE): BOOLEAN;
```

```python
def vs.GetWallInsLocByStyle(hObject):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|The symbol definition, plug-in object style, or plug-in object.|

## See Also
VS Functions:
SetWallInsLocByStyle

## Version
Availability: from Vectorworks 2022

## Category
* Objects - Custom